validation/anisoViscosity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Static pressure minus hydrostatic; the sealed domain is closed, so
    all walls are zero-flux (fixedFluxPressure).
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }
}

// ************************************************************************* //
